///-----2----///
/// Если переменная test равна true, то выведите 'Верно', иначе выведите
// 'Неверно'. Проверьте работу скрипта при test, равном true, false.
// Напишите два варианта скрипта - с короткой записью и с длинной.
let test=true;
if(test){
    console.log("верно");
} else {
    console.log("не верно");
}
test ? console.log('верно'): console.log('не верно');
//-----2----//
// Если переменная test не равна true, то выведите 'Верно',\
// иначе выведите 'Неверно'. Проверьте работу скрипта при test, равном true, false.
// Напишите два варианта скрипта - с короткой записью и с длинной.//
if(test!="true"){
    console.log('верно')
}
else {
    console
    console.log("не верно")
}
test? console.log("не верно"): console.log("верно");